#!/usr/bin/env python
# *Задача 20:* В настольной игре Скрабл (Scrabble) каждая буква имеет определенную ценность.
# В случае с английским алфавитом очки распределяются так:
# A, E, I, O, U, L, N, S, T, R – 1 очко;
# D, G – 2 очка;
# B, C, M, P – 3 очка;
# F, H, V, W, Y – 4 очка;
# K – 5 очков;
# J, X – 8 очков;
# Q, Z – 10 очков.
#
# А русские буквы оцениваются так:
# А, В, Е, И, Н, О, Р, С, Т – 1 очко;
# Д, К, Л, М, П, У – 2 очка;
# Б, Г, Ё, Ь, Я – 3 очка;
# Й, Ы – 4 очка;
# Ж, З, Х, Ц, Ч – 5 очков;
# Ш, Э, Ю – 8 очков;
# Ф, Щ, Ъ – 10 очков.
#
# Напишите программу, которая вычисляет стоимость введенного пользователем слова.
# Будем считать, что на вход подается только одно слово,
# которое содержит либо только английские, либо только русские буквы.

def scrabble_count(word: str) -> int:
    count = 0
    for char in word:
        count += find_points_for_char(char)
    return count

def find_points_for_char(char: str) -> int:
    unknown_char_points = 0
    charlist_to_points = {
        ("a", "e", "i", "o", "u", "l", "n", "s", "t", "r", "а", "в", "е", "и", "н", "о", "р", "с", "т"): 1,
        ("d", "g", "д", "к", "л", "м", "п", "у"): 2,
        ("b", "c", "m", "p", "б", "г", "ё", "ь", "я"): 3,
        ("f", "h", "v", "w", "y", "й", "ы"): 4,
        ("k", "ж", "з", "х", "ц", "ч"): 5,
        ("j", "x", "ш", "э", "ю"): 8,
        ("q", "z", "ф", "щ", "ъ"): 10,
    }
    for charlist in charlist_to_points.keys():
        if char in charlist:
            return charlist_to_points[charlist]
    return unknown_char_points


user_word = input("Введите слово: ")
print(f'Слово "{user_word}" дает вам {scrabble_count(user_word)} очков.')
